app/controllers/posts_controller.rb

  def index
    @author = Author.all

    if !params[:author].blank? @posts = Post.by_author(params[:author])
---
SELECT "authors".* FROM "authors"
SELECT "posts".* FROM "posts" WHERE (created_at >='2016-01-27 00:00:00.000000')